# Panda Exercices

Exercice 1:
Charger le fichier `customers.csv` et afficher les 5 premières lignes.

In [3]:
import pandas as pd

df = pd.read_csv('./data/customers.csv')
print(df)
# print(df.to_string())

    id     name  age        city
0    1    Alice   25       Paris
1    2      Bob   35        Lyon
2    3  Charlie   40   Marseille
3    4    Diana   28       Paris
4    5    Ethan   32       Lille
5    6    Fiona   29        Nice
6    7   George   45    Bordeaux
7    8   Hannah   31  Strasbourg
8    9      Ian   38       Paris
9   10     Jane   27        Lyon
10  11    Kevin   33        Nice
11  12    Linda   26   Marseille
12  13     Mike   36    Bordeaux
13  14     Nina   30       Lille
14  15    Oscar   34  Strasbourg

Exercice 2: Afficher uniquement la colonne `name`.

In [4]:
print(df['name'])

0       Alice
1         Bob
2     Charlie
3       Diana
4       Ethan
5       Fiona
6      George
7      Hannah
8         Ian
9        Jane
10      Kevin
11      Linda
12       Mike
13       Nina
14      Oscar
Name: name, dtype: object

Exercice 3: Lister les clients de Paris.

In [5]:
print(df[df['city'] == 'Paris'])
city = df.loc[df['city'] == 'Paris', 'name']
city

   id   name  age   city
0   1  Alice   25  Paris
3   4  Diana   28  Paris
8   9    Ian   38  Paris

0    Alice
3    Diana
8      Ian
Name: name, dtype: object

Exercice 4: Trier les clients par âge décroissant.

In [6]:
df.sort_values(by='age', ascending=False)

    id     name  age        city
6    7   George   45    Bordeaux
2    3  Charlie   40   Marseille
8    9      Ian   38       Paris
12  13     Mike   36    Bordeaux
1    2      Bob   35        Lyon
14  15    Oscar   34  Strasbourg
10  11    Kevin   33        Nice
4    5    Ethan   32       Lille
7    8   Hannah   31  Strasbourg
13  14     Nina   30       Lille
5    6    Fiona   29        Nice
3    4    Diana   28       Paris
9   10     Jane   27        Lyon
11  12    Linda   26   Marseille
0    1    Alice   25       Paris

Exercice 5: Compter combien de clients viennent de chaque ville.

In [7]:
count_city = df['city'].value_counts()
count_city
# count_city2 = df.groupby('city').size()
# count_city2

city
Paris         3
Lyon          2
Marseille     2
Lille         2
Nice          2
Bordeaux      2
Strasbourg    2
Name: count, dtype: int64

Exercice 6: Sauvegarder les clients de Lyon dans `data/lyon_clients.csv`.

In [8]:
lyon = df[df['city'] == 'Lyon']
lyon.to_csv('./data/lyon_clients.csv', index=False)

*(Optionnel)* Lister les clients dont le nom commence par “A”.

In [9]:
a = df[df['name'].str.startswith('A')]
# a = df[df.name.str.startswith('A')]
# df['name']
a

   id   name  age   city
0   1  Alice   25  Paris

Exercice 7: Charger la table `orders` depuis la base `marketing.db`.

In [48]:
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect('./data/marketing.db')

db_orders = pd.read_sql_query("SELECT * FROM orders", cnx)
db_orders

    id  customer_id  amount  order_date
0    1            1    39.9  2025-06-01
1    2            2   120.0  2025-06-02
2    3            1    59.0  2025-06-03
3    4            3    80.0  2025-06-04
4    5            4    25.0  2025-06-05
5    6            5    75.5  2025-06-06
6    7            2   200.0  2025-06-07
7    8           10    50.0  2025-06-08
8    9           10    90.0  2025-06-09
9   10           11   110.0  2025-06-10
10  11            2    60.0  2025-06-11

Exercice 8: Lister les 5 premières commandes avec le nom du client.

In [ ]:
# commandes_5 = pd.read_sql_query("SELECT * FROM orders ", cnx)
# commandes_5.head()
## ---
## Requêtes SQLite3:
commande = pd.read_sql_query("SELECT * FROM orders", cnx)
name = pd.read_sql_query("SELECT * FROM customers", cnx)
## Merge les tableaux:
# merged = pd.merge(commande,name, right_on='id', left_on='customer_id')
# merged.name
## or
order_list = commande.merge(name, on='id', how='left')
order_list.head()

0       Alice
1         Bob
2       Alice
3     Charlie
4       Diana
5       Ethan
6         Bob
7        Jane
8        Jane
9       Kevin
10        Bob
Name: name, dtype: object

Exercice 9: Calculer le total dépensé par chaque client.

In [50]:
query = "SELECT c.name, SUM(o.amount) AS total_depenses FROM customers c JOIN orders o ON c.id = o.customer_id GROUP BY c.name;"
spent = pd.read_sql_query(query, cnx)
spent
## or
# sum = order_list.groupby('name')['amount'].sum()
# sum

      name  total_depenses
0    Alice            98.9
1      Bob           380.0
2  Charlie            80.0
3    Diana            25.0
4    Ethan            75.5
5     Jane           140.0
6    Kevin           110.0

Exercice 10: Calculer le panier moyen par ville.

In [24]:
spent = pd.read_sql_query("SELECT c.city, AVG(o.amount) AS depense_moyenne FROM customers c JOIN orders o ON c.id = o.customer_id GROUP BY c.city;", cnx)
spent

        city  depense_moyenne
0      Lille             75.5
1       Lyon            104.0
2  Marseille             80.0
3       Nice            110.0
4      Paris             41.3

Exercice 11: Exporter le rapport des panier moyens par ville en CSV.

In [25]:
spent.to_csv('./data/exo11.csv', index=False)

*(Optionnel)* Trouver le top 3 clients par montant total.